#!/usr/bin/python3
import random
N = input('Enter the number of items in the list\n > ') # запит на введення к-сті елементів списку
N = int(N) # перетворення стрічки в ціле число
lst_N = [] # створення порожнього списку
for x in range(1,N+1): # цикл для наповнення списку випадковими елементами
	n = random.sample(range(1, N+1), 1) # вибір  1 випадкового елемента з проміжку від 1 до N включно
	lst_N.append(n) # додавання вибраного елемента в кінець списку 
print(lst_N) # друк початкового списку
for i in range(len(lst_N)-1): # цикл для вибору 1-го елемента для порівняння
	j = i + 1 # індекс 2-го елемента для порівняння (починається з наступного після 1-го)
	while j <= len(lst_N)-1: # порівняння проводиться доки індекс 2-го елемента не більший за індекв останнього елемента списку
		if lst_N[i] == lst_N[j]: # якщо елементи однакові
			lst_N.pop(j) # видалення елемента
			j-= 1 # для повторної перевірки елемента, що отримав індекс видаленого елемента, індекс зменшується на 1
		j += 1 # перехід до наступного 2-го елемента 	
print(lst_N) # друк списку без повторюваних елементів	